## taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'


## casks
# developer tools
cask 'iterm2'
cask 'sublime-text'
cask 'sublime-merge'
cask 'visual-studio-code'
cask 'adoptopenjdk8'
cask 'jetbrains-toolbox'
cask 'docker'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'google-cloud-sdk'

# office
cask 'microsoft-office'
cask 'google-backup-and-sync'

# messaging
cask 'skype'
cask 'mattermost'
cask 'slack'
cask 'whatsapp'

# utilities
cask 'appcleaner'
cask 'gfxcardstatus'
cask 'smcfancontrol'
cask 'steam'
cask 'transmission'

## formulaes
# system libs
brew 'autoconf'
brew 'automake'
brew 'freetype'
brew 'gettext'
brew 'libimagequant'
brew 'libjpeg'
brew 'libraqm'
brew 'libtiff'
brew 'libtool'
brew 'libxml2'
brew 'openjpeg'
brew 'openssl'
brew 'readline'
brew 'tcl-tk'
brew 'webp'
brew 'zlib'

# system tools
brew 'colordiff'
brew 'fasd'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'starship'
brew 'tmux'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'mas'

# languages
brew 'go'
brew 'nvm'
brew 'pyenv-virtualenv'
brew 'pyenv'
brew 'rust'

# cloud tools
brew 'awscli'
brew 'aws-elasticbeanstalk'
brew 'azure-cli'
brew 'kubernetes-cli'
brew 'kubecfg'
brew 'kubectx'
brew 'doctl'
brew 'terraform'

# devtools
brew 'bazel'
brew 'bfg'
brew 'git-standup'
brew 'git'
brew 'hey'
brew 'postgresql'
brew 'vim', args: ['override-system-vi']

# app store install

mas 'Xcode', id: 497799835
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Keynote', id: 409183694