## taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'


## casks
# developer tools
cask 'adoptopenjdk8'
cask 'dash'
cask 'docker'
cask 'dotnet-sdk'
cask 'firefox-developer-edition'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'menumeters'
cask 'openinterminal'
cask 'sublime-merge'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'wireshark'

# office
# cask 'microsoft-office'
cask 'google-drive'

# messaging
cask 'skype'
cask 'slack'
cask 'whatsapp'
cask 'zoom'

# utilities
cask 'appcleaner'
cask 'gfxcardstatus'
cask 'smcfancontrol'
cask 'steam'
cask 'the-unarchiver'
cask 'transmission'

## formulaes
# system libs
brew 'autoconf'
brew 'automake'
brew 'cfssl'
brew 'cmake'
brew 'freetype'
brew 'gettext'
brew 'libimagequant'
brew 'libjpeg'
brew 'libraqm'
brew 'libtiff'
brew 'libtool'
brew 'libxml2'
brew 'openjpeg'
brew 'openssl'
brew 'readline'
brew 'tcl-tk'
brew 'webp'
brew 'zlib'

# system tools
brew 'bat'
brew 'colordiff'
brew 'dust'
brew 'exa'
brew 'fasd'
brew 'fzf'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'mas'
brew 'starship'
brew 'tmux'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# languages
brew 'go'
brew 'pyenv-virtualenv'
brew 'pyenv'

# cloud 

## providers
brew 'aws-elasticbeanstalk'
brew 'awscli'
brew 'azure-cli'
brew 'doctl'

## infra
brew 'buildpacks/tap/pack'
brew 'infracost'
brew 'kubernetes-cli'
brew 'kubecfg'
brew 'kubectx'
brew 'kustomize'
brew 'k3d'
brew 'k9s'
brew 'helm'
brew 'istioctl'
brew 'skaffold'
brew 'tektoncd-cli'
brew 'terraformer'
brew 'warrensbox/tap/tfswitch'

# dev tools
brew 'bazel'
brew 'bfg'
brew 'gh'
brew 'git-flow'
brew 'git-standup'
brew 'git'
brew 'goaccess'
brew 'hey'
brew 'hyperfine'
brew 'mykolaharmash/git-jump/git-jump'
brew 'neovim'
brew 'nvie/tap/git-toolbelt'
brew 'postgresql'
brew 'tcpdump'
